report/sysbench/SSP_test/oltp_update_index.master_ssp_200.txt
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 200
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 200 tps: 106619.34 qps: 106619.34 (r/w/o: 0.00/106619.34/0.00) lat (ms,99%): 13.46 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 200 tps: 108818.90 qps: 108818.90 (r/w/o: 0.00/108818.90/0.00) lat (ms,99%): 13.70 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 200 tps: 110722.71 qps: 110722.71 (r/w/o: 0.00/110722.71/0.00) lat (ms,99%): 13.46 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 200 tps: 102653.15 qps: 102653.15 (r/w/o: 0.00/102653.15/0.00) lat (ms,99%): 13.46 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 200 tps: 102052.58 qps: 102052.58 (r/w/o: 0.00/102052.58/0.00) lat (ms,99%): 13.46 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 200 tps: 84085.85 qps: 84085.85 (r/w/o: 0.00/84085.85/0.00) lat (ms,99%): 13.46 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 200 tps: 115689.07 qps: 115689.07 (r/w/o: 0.00/115689.07/0.00) lat (ms,99%): 13.46 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 200 tps: 101988.53 qps: 101988.53 (r/w/o: 0.00/101988.53/0.00) lat (ms,99%): 13.46 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 200 tps: 97210.34 qps: 97210.34 (r/w/o: 0.00/97210.34/0.00) lat (ms,99%): 13.70 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 200 tps: 106175.48 qps: 106175.48 (r/w/o: 0.00/106175.48/0.00) lat (ms,99%): 13.46 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 200 tps: 120491.35 qps: 120491.35 (r/w/o: 0.00/120491.35/0.00) lat (ms,99%): 13.46 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 200 tps: 95444.56 qps: 95444.56 (r/w/o: 0.00/95444.56/0.00) lat (ms,99%): 13.70 err/s: 0.00 reconn/s: 0.00
[ 65s ] thds: 200 tps: 94569.92 qps: 94569.92 (r/w/o: 0.00/94569.92/0.00) lat (ms,99%): 13.46 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 200 tps: 85395.10 qps: 85395.10 (r/w/o: 0.00/85395.10/0.00) lat (ms,99%): 13.70 err/s: 0.00 reconn/s: 0.00
[ 75s ] thds: 200 tps: 113629.14 qps: 113629.14 (r/w/o: 0.00/113629.14/0.00) lat (ms,99%): 13.46 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 200 tps: 95405.18 qps: 95405.18 (r/w/o: 0.00/95405.18/0.00) lat (ms,99%): 13.70 err/s: 0.00 reconn/s: 0.00
[ 85s ] thds: 200 tps: 87897.26 qps: 87897.26 (r/w/o: 0.00/87897.26/0.00) lat (ms,99%): 13.70 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 200 tps: 101082.39 qps: 101082.39 (r/w/o: 0.00/101082.39/0.00) lat (ms,99%): 13.46 err/s: 0.00 reconn/s: 0.00
[ 95s ] thds: 200 tps: 91898.72 qps: 91898.72 (r/w/o: 0.00/91898.72/0.00) lat (ms,99%): 13.70 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 200 tps: 105216.50 qps: 105216.50 (r/w/o: 0.00/105216.50/0.00) lat (ms,99%): 13.46 err/s: 0.00 reconn/s: 0.00
[ 105s ] thds: 200 tps: 69180.25 qps: 69180.25 (r/w/o: 0.00/69180.25/0.00) lat (ms,99%): 13.70 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 200 tps: 104248.09 qps: 104248.09 (r/w/o: 0.00/104248.09/0.00) lat (ms,99%): 13.70 err/s: 0.00 reconn/s: 0.00
[ 115s ] thds: 200 tps: 108064.90 qps: 108064.90 (r/w/o: 0.00/108064.90/0.00) lat (ms,99%): 13.46 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 200 tps: 108056.78 qps: 108056.78 (r/w/o: 0.00/108056.78/0.00) lat (ms,99%): 13.70 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           12083638
        other:                           0
        total:                           12083638
    transactions:                        12083638 (100668.85 per sec.)
    queries:                             12083638 (100668.85 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          120.0322s
    total number of events:              12083638

Latency (ms):
         min:                                    0.29
         avg:                                    1.99
         max:                                  881.60
         99th percentile:                       13.46
         sum:                             23996077.82

Threads fairness:
    events (avg/stddev):           60418.1900/283.51
    execution time (avg/stddev):   119.9804/0.01