report/sysbench/SSP_test/oltp_update_non_index.master_ssm_200.txt
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 200
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 200 tps: 45717.61 qps: 45717.61 (r/w/o: 0.00/45717.61/0.00) lat (ms,99%): 15.27 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 200 tps: 46983.01 qps: 46983.01 (r/w/o: 0.00/46983.01/0.00) lat (ms,99%): 15.55 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 200 tps: 48332.15 qps: 48332.15 (r/w/o: 0.00/48332.15/0.00) lat (ms,99%): 14.21 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 200 tps: 47857.72 qps: 47857.72 (r/w/o: 0.00/47857.72/0.00) lat (ms,99%): 14.73 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 200 tps: 46044.45 qps: 46044.45 (r/w/o: 0.00/46044.45/0.00) lat (ms,99%): 15.55 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 200 tps: 46568.39 qps: 46568.39 (r/w/o: 0.00/46568.39/0.00) lat (ms,99%): 15.55 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 200 tps: 46992.98 qps: 46992.98 (r/w/o: 0.00/46992.98/0.00) lat (ms,99%): 14.46 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 200 tps: 48123.49 qps: 48123.49 (r/w/o: 0.00/48123.49/0.00) lat (ms,99%): 14.73 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 200 tps: 48139.02 qps: 48139.02 (r/w/o: 0.00/48139.02/0.00) lat (ms,99%): 14.73 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 200 tps: 47692.47 qps: 47692.47 (r/w/o: 0.00/47692.47/0.00) lat (ms,99%): 15.27 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 200 tps: 47178.85 qps: 47178.85 (r/w/o: 0.00/47178.85/0.00) lat (ms,99%): 14.73 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 200 tps: 46748.71 qps: 46748.71 (r/w/o: 0.00/46748.71/0.00) lat (ms,99%): 15.55 err/s: 0.00 reconn/s: 0.00
[ 65s ] thds: 200 tps: 47225.92 qps: 47225.92 (r/w/o: 0.00/47225.92/0.00) lat (ms,99%): 14.46 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 200 tps: 47713.98 qps: 47713.98 (r/w/o: 0.00/47713.98/0.00) lat (ms,99%): 15.27 err/s: 0.00 reconn/s: 0.00
[ 75s ] thds: 200 tps: 46725.23 qps: 46725.23 (r/w/o: 0.00/46725.23/0.00) lat (ms,99%): 16.12 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 200 tps: 47404.21 qps: 47404.21 (r/w/o: 0.00/47404.21/0.00) lat (ms,99%): 15.27 err/s: 0.00 reconn/s: 0.00
[ 85s ] thds: 200 tps: 42457.64 qps: 42457.64 (r/w/o: 0.00/42457.64/0.00) lat (ms,99%): 19.29 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 200 tps: 45116.38 qps: 45116.38 (r/w/o: 0.00/45116.38/0.00) lat (ms,99%): 17.01 err/s: 0.00 reconn/s: 0.00
[ 95s ] thds: 200 tps: 45142.50 qps: 45142.50 (r/w/o: 0.00/45142.50/0.00) lat (ms,99%): 17.01 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 200 tps: 45469.64 qps: 45469.64 (r/w/o: 0.00/45469.64/0.00) lat (ms,99%): 17.95 err/s: 0.00 reconn/s: 0.00
[ 105s ] thds: 200 tps: 47874.87 qps: 47874.87 (r/w/o: 0.00/47874.87/0.00) lat (ms,99%): 14.73 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 200 tps: 47175.69 qps: 47175.69 (r/w/o: 0.00/47175.69/0.00) lat (ms,99%): 14.73 err/s: 0.00 reconn/s: 0.00
[ 115s ] thds: 200 tps: 46238.82 qps: 46238.82 (r/w/o: 0.00/46238.82/0.00) lat (ms,99%): 15.27 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 200 tps: 47222.98 qps: 47222.98 (r/w/o: 0.00/47222.98/0.00) lat (ms,99%): 14.73 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           5611128
        other:                           0
        total:                           5611128
    transactions:                        5611128 (46746.89 per sec.)
    queries:                             5611128 (46746.89 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          120.0307s
    total number of events:              5611128

Latency (ms):
         min:                                    1.44
         avg:                                    4.28
         max:                                  241.19
         99th percentile:                       15.27
         sum:                             23998712.76

Threads fairness:
    events (avg/stddev):           28055.6400/68.28
    execution time (avg/stddev):   119.9936/0.01