report/sysbench/SSP_test/oltp_update_non_index.master_ssp_200.txt
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 200
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 200 tps: 156100.49 qps: 156100.49 (r/w/o: 0.00/156100.49/0.00) lat (ms,99%): 12.30 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 200 tps: 113008.85 qps: 113008.85 (r/w/o: 0.00/113008.85/0.00) lat (ms,99%): 12.52 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 200 tps: 136942.16 qps: 136942.16 (r/w/o: 0.00/136942.16/0.00) lat (ms,99%): 12.75 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 200 tps: 154332.71 qps: 154332.71 (r/w/o: 0.00/154332.71/0.00) lat (ms,99%): 12.30 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 200 tps: 145978.58 qps: 145978.58 (r/w/o: 0.00/145978.58/0.00) lat (ms,99%): 12.08 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 200 tps: 151203.54 qps: 151203.54 (r/w/o: 0.00/151203.54/0.00) lat (ms,99%): 12.30 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 200 tps: 143634.85 qps: 143634.85 (r/w/o: 0.00/143634.85/0.00) lat (ms,99%): 12.08 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 200 tps: 135410.10 qps: 135410.10 (r/w/o: 0.00/135410.10/0.00) lat (ms,99%): 12.52 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 200 tps: 119647.96 qps: 119647.96 (r/w/o: 0.00/119647.96/0.00) lat (ms,99%): 12.30 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 200 tps: 149789.25 qps: 149789.25 (r/w/o: 0.00/149789.25/0.00) lat (ms,99%): 12.30 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 200 tps: 134857.17 qps: 134857.17 (r/w/o: 0.00/134857.17/0.00) lat (ms,99%): 12.08 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 200 tps: 156556.21 qps: 156556.21 (r/w/o: 0.00/156556.21/0.00) lat (ms,99%): 12.08 err/s: 0.00 reconn/s: 0.00
[ 65s ] thds: 200 tps: 141573.05 qps: 141573.05 (r/w/o: 0.00/141573.05/0.00) lat (ms,99%): 11.87 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 200 tps: 130247.46 qps: 130247.46 (r/w/o: 0.00/130247.46/0.00) lat (ms,99%): 12.52 err/s: 0.00 reconn/s: 0.00
[ 75s ] thds: 200 tps: 154021.30 qps: 154021.30 (r/w/o: 0.00/154021.30/0.00) lat (ms,99%): 12.52 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 200 tps: 121463.65 qps: 121463.65 (r/w/o: 0.00/121463.65/0.00) lat (ms,99%): 12.30 err/s: 0.00 reconn/s: 0.00
[ 85s ] thds: 200 tps: 141838.03 qps: 141838.03 (r/w/o: 0.00/141838.03/0.00) lat (ms,99%): 12.52 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 200 tps: 147984.60 qps: 147984.60 (r/w/o: 0.00/147984.60/0.00) lat (ms,99%): 12.08 err/s: 0.00 reconn/s: 0.00
[ 95s ] thds: 200 tps: 119374.14 qps: 119374.14 (r/w/o: 0.00/119374.14/0.00) lat (ms,99%): 12.30 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 200 tps: 130176.44 qps: 130176.84 (r/w/o: 0.00/130176.84/0.00) lat (ms,99%): 12.52 err/s: 0.00 reconn/s: 0.00
[ 105s ] thds: 200 tps: 129887.62 qps: 129887.22 (r/w/o: 0.00/129887.22/0.00) lat (ms,99%): 12.08 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 200 tps: 120408.80 qps: 120408.80 (r/w/o: 0.00/120408.80/0.00) lat (ms,99%): 12.08 err/s: 0.00 reconn/s: 0.00
[ 115s ] thds: 200 tps: 147346.46 qps: 147346.46 (r/w/o: 0.00/147346.46/0.00) lat (ms,99%): 11.87 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 200 tps: 146768.89 qps: 146768.89 (r/w/o: 0.00/146768.89/0.00) lat (ms,99%): 12.08 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           16643537
        other:                           0
        total:                           16643537
    transactions:                        16643537 (138216.22 per sec.)
    queries:                             16643537 (138216.22 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          120.4153s
    total number of events:              16643537

Latency (ms):
         min:                                    0.28
         avg:                                    1.45
         max:                                  903.37
         99th percentile:                       12.30
         sum:                             24070269.68

Threads fairness:
    events (avg/stddev):           83217.6850/367.88
    execution time (avg/stddev):   120.3513/0.00